tutorials/combustion/fireFoam/les/smallPoolFire3D/constant/reactions
species
(
    O2
    H2O
    CH4
    CO2
    N2
);

reactions
{
    propaneReaction
    {
        type         irreversibleinfiniteReaction;
        reaction     "CH4 + 2O2 = CO2 + 2H2O";
    }
}
